practica/_OF/OutFlujoExtCilindro/0/mag(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mag(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
5200
(
1.4199
1.31722
1.2451
1.19343
1.15571
1.12766
1.10648
1.09021
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.993569
0.993591
0.993636
0.993702
0.99379
0.993899
0.994029
0.994179
...
)
;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            calculated;
        value           uniform 1;
    }
    cylinder
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
